2022.11.15.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2022.11.08.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2022.11.22.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of November 08 to 15, 2022.

#+TOC: headlines 1


* OCaml Platform Installer alpha release
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-ocaml-platform-installer-alpha-release/10652/10

** Continuing this thread, Paul-Elliot explained


Let me try to explain a little bit more!

So, there are two distinct process:
1. Installing ~ocaml-platform~. This is done by the installer script which, as you found out, also installs opam.
2. Installing the platform tools: ~merlin~, ~dune~, ~ocamlformat~, ... This is done by running ~ocaml-platform~ (more explanation of what happens during a run of ~ocaml-platform~ below).

For 1., I agree that using a script is not ideal at all. We do want to have a system package, ideally as part of a
distribution. However, we are really at an early stage, and first focused on developing the "core" functionality,
for feedback before going further.
Note that ~sudo~ is only used when needed (for the ~install~ command), and that we encourage users to check what is
inside the script: Taken from the README:
#+begin_quote
Don't hesitate to have a look at what the script does. In a nutshell, the script will install a static binary into
~/usr/local/bin/ocaml-platform~ as well as the ~opam~ binary if it isn't already installed.
#+end_quote

For 2. here is what happens when you run ~ocaml-platform~ (also detailed in the
[[https://github.com/tarides/ocaml-platform-installer#readme][README]]):
- First, "driving" ~opam~, ~ocaml-platform~ infer a version of each platform tools (~dune~ ~merlin~ etc). It will use the best one available for your version of OCaml, except for ~ocamlformat~ where it will first search for a ~.ocamlformat~ with a specified version.
- Then, ~ocaml-platform~ checks which of the ~tools.version~ it has in a local cache (which is initially empty).
- Using ~opam~, it builds in a "sandbox switch" the ones to build (the ones that are not already in the cache)
- it populates the local cache with the newly built package
- Using ~opam~, it installs everything from the local cache (which is a local opam repo).

So, to answer your question:
#+begin_quote
What happens when a new version of dune is released, how do I get an update using “ocaml-platform-installer”?
#+end_quote
You simply need to run ~ocaml-plaform~, it will know that there is a new version of ~dune~ by asking ~opam~ the best
version available. (I answered incorrectly the first time as I thought you were specifically speaking about a new
version of ~ocaml-platform~, my apologies!)

#+begin_quote
> In fact, currently only the ~ocaml-platform~ binary is being downloaded.

When I look into ~installer.sh~, at least also ~opam~ is downloaded and “installed” (copied to PREFIX, there’s a
lack of manpages etc.).
#+end_quote

Yes, I forgot about opam's installation... I meant that only ~ocaml-platform~ (and ~opam~...) is downloaded _through
the install script_. Other tools are downloaded through opam.

#+begin_quote
> We do have security in mind!

Could you elaborate on that?
#+end_quote
I simply meant that, when discussing how the tool would work, we tried not to miss security issues. Since most of
the communication with the outside world is done through opam, we felt it was okay, but I am no security expert...
and would love specific advices on the matter :)

@hannes I hope that I answered your questions in a clearer way!

#+begin_quote
It looks like the ~ocaml-platform~ tool would be beneficial even if you already have ~opam~ and a development
environment, as it seems to offer a convenient way to share various developer tools between multiple ~opam~ switches
(and it could perhaps build and install itself as one of such tools, so it can be conveniently be kept up to date).
#+end_quote

@edwin that's a good point! There are still some things to work out: since the tool is not switch dependent, having
multiple versions of it (even in multiple switches) might create problem (for instance, v2 updates the cache to the
v2 version, and v1 cannot use the cache anymore. (Similar to opam 1 and 2 with the update of ~.opam~!))
      



* Building the OCaml Toolchain with Bazel - PoC
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-building-the-ocaml-toolchain-with-bazel-poc/10776/1

