2022.11.15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-15 Tue 13:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2022.11.08.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2022.11.22.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of November 08 to 15, 2022.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">OCaml Platform Installer alpha release</a></li>
<li><a href="#2">Building the OCaml Toolchain with Bazel - PoC</a></li>
<li><a href="#3">OCaml compiler development newsletter, issue 6: March 2022 to September 2022</a></li>
<li><a href="#4">diskuvbox: small set of cross-platform CLI tools</a></li>
<li><a href="#5">http_async 0.2.0</a></li>
<li><a href="#6">Other OCaml News</a></li>
<li><a href="#orgf7955cd">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">OCaml Platform Installer alpha release</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-platform-installer-alpha-release/10652/10">https://discuss.ocaml.org/t/ann-ocaml-platform-installer-alpha-release/10652/10</a>
</p>
</div>

<div id="outline-container-orgf5e4b3d" class="outline-3">
<h3 id="orgf5e4b3d">Continuing this thread, Paul-Elliot explained</h3>
<div class="outline-text-3" id="text-orgf5e4b3d">
<p>
Let me try to explain a little bit more!
</p>

<p>
So, there are two distinct process:
</p>
<ol class="org-ol">
<li>Installing <code>ocaml-platform</code>. This is done by the installer script which, as you found out, also installs opam.</li>
<li>Installing the platform tools: <code>merlin</code>, <code>dune</code>, <code>ocamlformat</code>, &#x2026; This is done by running <code>ocaml-platform</code> (more explanation of what happens during a run of <code>ocaml-platform</code> below).</li>
</ol>

<p>
For 1., I agree that using a script is not ideal at all. We do want to have a system package, ideally as part of a
distribution. However, we are really at an early stage, and first focused on developing the &ldquo;core&rdquo; functionality,
for feedback before going further.
Note that <code>sudo</code> is only used when needed (for the <code>install</code> command), and that we encourage users to check what is
inside the script: Taken from the README:
</p>
<blockquote>
<p>
Don&rsquo;t hesitate to have a look at what the script does. In a nutshell, the script will install a static binary into
<code>/usr/local/bin/ocaml-platform</code> as well as the <code>opam</code> binary if it isn&rsquo;t already installed.
</p>
</blockquote>

<p>
For 2. here is what happens when you run <code>ocaml-platform</code> (also detailed in the
<a href="https://github.com/tarides/ocaml-platform-installer#readme">README</a>):
</p>
<ul class="org-ul">
<li>First, &ldquo;driving&rdquo; <code>opam</code>, <code>ocaml-platform</code> infer a version of each platform tools (<code>dune</code> <code>merlin</code> etc). It will use the best one available for your version of OCaml, except for <code>ocamlformat</code> where it will first search for a <code>.ocamlformat</code> with a specified version.</li>
<li>Then, <code>ocaml-platform</code> checks which of the <code>tools.version</code> it has in a local cache (which is initially empty).</li>
<li>Using <code>opam</code>, it builds in a &ldquo;sandbox switch&rdquo; the ones to build (the ones that are not already in the cache)</li>
<li>it populates the local cache with the newly built package</li>
<li>Using <code>opam</code>, it installs everything from the local cache (which is a local opam repo).</li>
</ul>

<p>
So, to answer your question:
</p>
<blockquote>
<p>
What happens when a new version of dune is released, how do I get an update using “ocaml-platform-installer”?
</p>
</blockquote>
<p>
You simply need to run <code>ocaml-plaform</code>, it will know that there is a new version of <code>dune</code> by asking <code>opam</code> the best
version available. (I answered incorrectly the first time as I thought you were specifically speaking about a new
version of <code>ocaml-platform</code>, my apologies!)
</p>

<blockquote>
<p>
&gt; In fact, currently only the <code>ocaml-platform</code> binary is being downloaded.
</p>

<p>
When I look into <code>installer.sh</code>, at least also <code>opam</code> is downloaded and “installed” (copied to PREFIX, there’s a
lack of manpages etc.).
</p>
</blockquote>

<p>
Yes, I forgot about opam&rsquo;s installation&#x2026; I meant that only <code>ocaml-platform</code> (and <code>opam</code>&#x2026;) is downloaded <span class="underline">through
the install script</span>. Other tools are downloaded through opam.
</p>

<blockquote>
<p>
&gt; We do have security in mind!
</p>

<p>
Could you elaborate on that?
</p>
</blockquote>
<p>
I simply meant that, when discussing how the tool would work, we tried not to miss security issues. Since most of
the communication with the outside world is done through opam, we felt it was okay, but I am no security expert&#x2026;
and would love specific advices on the matter :)
</p>

<p>
@hannes I hope that I answered your questions in a clearer way!
</p>

<blockquote>
<p>
It looks like the <code>ocaml-platform</code> tool would be beneficial even if you already have <code>opam</code> and a development
environment, as it seems to offer a convenient way to share various developer tools between multiple <code>opam</code> switches
(and it could perhaps build and install itself as one of such tools, so it can be conveniently be kept up to date).
</p>
</blockquote>

<p>
@edwin that&rsquo;s a good point! There are still some things to work out: since the tool is not switch dependent, having
multiple versions of it (even in multiple switches) might create problem (for instance, v2 updates the cache to the
v2 version, and v1 cannot use the cache anymore. (Similar to opam 1 and 2 with the update of <code>.opam</code>!))
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Building the OCaml Toolchain with Bazel - PoC</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-building-the-ocaml-toolchain-with-bazel-poc/10776/1">https://discuss.ocaml.org/t/ann-building-the-ocaml-toolchain-with-bazel-poc/10776/1</a>
</p>
</div>
