2022.11.15.html

<div id="outline-container-org9420ce8" class="outline-3">
<h3 id="org9420ce8">Gregg Reynolds announced</h3>
<div class="outline-text-3" id="text-org9420ce8">
<p>
I&rsquo;m inordinately pleased to announce that a Proof-of-Concept Bazel build of the OCaml compilers and tools (latest
trunk version) is available for testing and exploration. Tested on MacOS 12.6 and Ubuntu 20.04.5 LTS. It is
available at
</p>

<p>
<a href="https://github.com/obazl-repository/ocaml">https://github.com/obazl-repository/ocaml</a>
</p>

<p>
This uses a stripped-down version of <a href="https://github.com/obazl/rules_ocaml">rules_ocaml</a>, embedded in the repo in
subdirectory <code>bzl</code>.
</p>

<p>
Currently the following targets build and run: ocamlc, ocamlopt.byte, ocamllex, all of the tools in the <code>tools/</code>
subdirectory.
</p>

<p>
Supports Zig as an alternate C toolchain and as a cross-compiler. I was also able to use the LLVM toolchain at
<a href="https://github.com/grailbio/bazel-toolchain">https://github.com/grailbio/bazel-toolchain</a>, but that was months ago and I have not tested it with this new version.
But the code is in the WORKSPACE.bazel file, so getting it to work would be a good starter project.
</p>

<p>
Cross-compilation (using Zig) is supported for the C code. Full support is going to take some more work. For
example, to compile a linux runtime on a mac:
</p>

<p>
<code>$ bazel build boot/bin:ocamlrun --config=mac_linuxamd64</code>
</p>

<p>
It uses some interesting Bazel features. For example, it uses platforms and toolchains to support the various
compilers - instead of building ocamlc.byte or ocamlopt.byte, you build one target (boot/compiler) and pass CLI args
telling Bazel which platform (vm or sys) should host the build compiler and which should be the target. Similarly,
debug and instrumented variants are controlled by parameters rather than separate targets. It also supports
fine-grained control of compile/link flags, so developers should be able to optimize for diffferent scenarios. You
can tell it whether or not to compile .mli files separately. You can pass a custom <code>primitives</code> file for use with
<code>-use-prims</code> and it will be used everywhere. Etc.
</p>

<p>
It&rsquo;s far from polished but I think it works well enough for people to do a little testing and exploration.
</p>

<p>
Even if you have no interest in Bazel you may find the notes in the bzl/docs subdir worth looking at. I spent a
<i>lot</i> of time studying the Makefiles and trying to understand the build, and took pretty extensive notes. They&rsquo;re
not very well organized but they have a lot of info, I think.
</p>

<p>
Feedback welcome. I&rsquo;m not sure how far I&rsquo;ll go with this, but I at least want to get complete cross-compilation
working, and I&rsquo;d also really like to get persistent workers going.
</p>
</div>
</div>


<div id="outline-container-orge2cc8ce" class="outline-3">
<h3 id="orge2cc8ce">Danielo Rodríguez asked and Gregg Reynolds replied</h3>
<div class="outline-text-3" id="text-orge2cc8ce">
<blockquote>
<p>
Is this bazel configuration intended to be used in ocaml projects or it is a way to cross-compile the ocaml tools
itself?
</p>
</blockquote>

<p>
Only for building the compilers.  The general rules_ocaml ruleset must support a lot of stuff that is not needed for
building the compilers (e.g. ppx support), and the build protocol for bootstrapping compilers is a little more
complicated than the standard build protocol.  For that very reason (among others), compiler developers need a build
program that they can understand and modify with reasonable effort. So I decided to make the OCaml boot rules as
minimal and understandable as possible (I forgot to add &ldquo;maintinability&rdquo; in the Goals section of the readme.)  I
think eventually the Bazel rules (including the implementation code) will be pretty easy to understand; I&rsquo;m
currently cleaning up and refactoring the source code to get rid of all the cruft left over from development.
</p>

<p>
I think there is a very felicitous side-effect of all this, which is that the Bazel build program makes the build
structure very clear and pretty simple, and Bazel features (like querying) make it very easy to explore and
experiment. So much so that I can envision that it could be used in introductory OCaml material.  Why not use the
source code of the compiler itself to learn not only how to program in OCaml but how to organize and manage code?
</p>

<p>
To <i>use</i> a compiler built using these rules one could write some installation rules, or in a Bazel-based project use
a toolchain that depends on it (rather than an OPAM-installed compiler, which is what rules_ocaml currently uses.)
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">OCaml compiler development newsletter, issue 6: March 2022 to September 2022</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-6-march-2022-to-september-2022/10777/1">https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-6-march-2022-to-september-2022/10777/1</a>
</p>
</div>

<div id="outline-container-org3e5de3d" class="outline-3">
<h3 id="org3e5de3d">gasche announced</h3>
<div class="outline-text-3" id="text-org3e5de3d">
<p>
I’m happy to publish the sixth issue of the “OCaml compiler development newsletter”. You can find all issues using
the tag <a href="https://discuss.ocaml.org/tag/compiler-newsletter">compiler-newsletter </a>.
</p>

<p>
Note: the content of the newsletter is by no means exhaustive, only a few of the compiler maintainers and
contributor had the time to write something, which is perfectly fine.
</p>

<p>
Feel free of course to comment or ask questions!
</p>

<p>
If you have been working on the OCaml compiler and want to say something, please feel free to post in this thread!
If you would like me to get in touch next time I prepare a newsletter issue (some random point in the future),
please let me know by Discuss message or by email at (gabriel.scherer at gmail).
</p>
</div>

<div id="outline-container-org1aef94d" class="outline-4">
<h4 id="org1aef94d">Context</h4>
<div class="outline-text-4" id="text-org1aef94d">
<p>
The Multicore merge is behind us now. We are in the final preparation stages for 5.0 (but by no means the end of the
Multicore-related work, many things were left to do in 5.1 and further releases). The non-Multicore-development has
been restarting slowly but surely.
</p>
</div>
</div>

<div id="outline-container-org49d4ade" class="outline-4">
<h4 id="org49d4ade">@yallop Jeremy Yallop</h4>
<div class="outline-text-4" id="text-org49d4ade">
<p>
We&rsquo;re starting up the <a href="https://www.cl.cam.ac.uk/~jdy22/projects/modular-macros/">modular macros</a> work at Cambridge
again, with the aim of adding support for typed, hygienic, compile-time computation to OCaml.  Back in 2015 we
presented our original design at the OCaml Users and Developers Workshop, and we subsequently went on to develop a
prototype in a branch of the OCaml compiler.  We&rsquo;re planning to complete, formalise, and fully implement the design
in the coming months.
</p>
</div>
</div>
