2022.11.15.org
*** @dra27 David Allsopp

Various bits of house-keeping on the compiler distribution have been managed for 5.0, taking advantage of the major
version increment. All the compiler's C symbols are now prefixed ~caml_~, vastly reducing the risks of conflicts
with other libraries (#[[https://github.com/ocaml/ocaml/pull/10926][10926]] and
#[[https://github.com/ocaml/ocaml/pull/11336][11336]]). The 5.x compiler now installs all of its additional libraries
(Unix, Str, etc.) to separate directories, with a friendly warning that you need to specify ~-I +unix~ etc. which
makes life slightly easier for build systems (#[[https://github.com/ocaml/ocaml/pull/11198][11198]]) and the compiler
now also ships ~META~ files for all its libraries by default (#[[https://github.com/ocaml/ocaml/pull/11007][11007]]
and #[[https://github.com/ocaml/ocaml/pull/11399][11399]]). Various other bits of 5.0-related poking include a
deprecation to allow the possibility in future for sub-commands to the ~ocaml~ command. Instead of ~ocaml script~,
one should now write ~ocaml ./script~ (#[[https://github.com/ocaml/ocaml/pull/11253][11253]]). The compiler's
bootstrap process (this is the mechanism which updates the initial compiler in ~boot/ocamlc~ which is used to build
the compiler "from cold") is now reproducible (#[[https://github.com/ocaml/ocaml/pull/11149][11149]]), easing the
review process for pull requests which need to include changes to the boot compiler. Previously we required a core
developer to re-do the bootstrap and then separately merge the work, where now a core developer can merely pull the
branch and check that the committed artefact is reproducible.

Looking beyond the release of OCaml 5.0, I've also been working to resurrect the disabled Cygwin port of OCaml
(#[[https://github.com/ocaml/ocaml/pull/11642][11642]]) and, more importantly, getting the MSVC native Windows port
working again (that's still WIP!).

At the OCaml Workshop this year, I demonstrated my "relocatable compiler" project, which aims both to eliminate
various kinds of "papercut" when using bytecode executables but, much more importantly, allows compiler
installations to be copied to new locations and still work, which paves the way for faster creation of opam switches
_everywhere_. It was great to be able to meet so many people in person in Slovenia for the first in-person workshop
since 2019, but unfortunately that came at the cost of catching COVID, which has slowed me down for the weeks since!
The next stage for the relocatable compiler is to have an opam remote which can be added to allow opt-in testing of
it with OCaml 4.08-5.0 and then to start opening pull requests hopefully for inclusion of the required changes in
OCaml 5.1 or 5.2.

*** @sadiqj Sadiq Jaffer

The bulk of my upstream work over the last year in OCaml 5.0 has been on Runtime Events, a new tracing and metrics
system that sits inside the OCaml runtime. The initial PR can be found at
#[[https://github.com/ocaml/ocaml/issues/10964][10964]] and there was a separate documentation PR in
#[[https://github.com/ocaml/ocaml/issues/11349][11349]]. Lucas Pluvinage has followed up with PR
#[[https://github.com/ocaml/ocaml/issues/11474][11474]] which adds custom application events to Runtime Events and I
hope isn't too far off merging. We gave a talk at the OCaml Users and Developers workshop on Runtime Events and I'm
hoping there will be a video up on that soon.

*** @garrigue Jacques Garrigue

We have continued our work on refactoring the type checker for clarity and abstraction.
An interesting result was PR #[[https://github.com/ocaml/ocaml/issues/11027][11027]]: separate typing of
counter-examples from ~Typecore.type_pat~. Namely, around 2015 ~type_pat~ was converted to CPS style to allow a more
refined way to check the exhaustiveness of GADT pattern-matching. A few more changes made the code more and more
complex, but last year in #[[https://github.com/ocaml/ocaml/issues/10311][10311]] we could extract a lot of code as
case-specific constraints. This in turn made possible separating ~type_pat~ into two functions: ~type_pat~ itself,
only used to type patterns in the source program, which doesn't need backtracking, and ~check_counter_example_pat~,
a much simpler function which works on counter examples generated by the exhaustiveness checker.
I have also added a ~-safer-matching~ flag for people who don't want the correctness of compilation to depend on the
subtle typing arguments involved in this analysis (#[[https://github.com/ocaml/ocaml/issues/10834][10834]]).
In another direction, we have reorganized the representation of type parameter variances, to make the lattice
involved more explicit (#[[https://github.com/ocaml/ocaml/issues/11018][11018]]).
We have a few PRs waiting for merging: #[[https://github.com/ocaml/ocaml/issues/11536][11536]] introduces some wrapper
functions for level management in types, #[[https://github.com/ocaml/ocaml/issues/11569][11569]] removes the encoding
used to represent the path of hash-types associated with a class, as it was not used in any meaningful way.

There are also a large number of bug fixes (#[[https://github.com/ocaml/ocaml/issues/10738][10738]],
#[[https://github.com/ocaml/ocaml/issues/10823][10823]], #[[https://github.com/ocaml/ocaml/issues/10959][10959]],
#[[https://github.com/ocaml/ocaml/issues/11109][11109]], #[[https://github.com/ocaml/ocaml/issues/11340][11340]],
#[[https://github.com/ocaml/ocaml/issues/11648][11648]]). The most interesting of them is
#[[https://github.com/ocaml/ocaml/issues/11648][11648]], which extends ~type_desc~ to allow keeping expansions inside
types. This is needed to fix a number of bugs, including #[[https://github.com/ocaml/ocaml/issues/9314][9314]], but
the change is invasive, and reviewing may take a while.

Coqgen, the Coq backend (previously named ocaml_in_coq), is still progressing, with the addition of constructs such
as loops, lazy values and exceptions [[https://github.com/COCTI/ocaml/pull/3][Coqgen]], and we are trying to include
GADTs in a comprehensive way.

