2022.11.15.html

<div id="outline-container-orgf017587" class="outline-4">
<h4 id="orgf017587">@dra27 David Allsopp</h4>
<div class="outline-text-4" id="text-orgf017587">
<p>
Various bits of house-keeping on the compiler distribution have been managed for 5.0, taking advantage of the major
version increment. All the compiler&rsquo;s C symbols are now prefixed <code>caml_</code>, vastly reducing the risks of conflicts
with other libraries (#<a href="https://github.com/ocaml/ocaml/pull/10926">10926</a> and
#<a href="https://github.com/ocaml/ocaml/pull/11336">11336</a>). The 5.x compiler now installs all of its additional libraries
(Unix, Str, etc.) to separate directories, with a friendly warning that you need to specify <code>-I +unix</code> etc. which
makes life slightly easier for build systems (#<a href="https://github.com/ocaml/ocaml/pull/11198">11198</a>) and the compiler
now also ships <code>META</code> files for all its libraries by default (#<a href="https://github.com/ocaml/ocaml/pull/11007">11007</a>
and #<a href="https://github.com/ocaml/ocaml/pull/11399">11399</a>). Various other bits of 5.0-related poking include a
deprecation to allow the possibility in future for sub-commands to the <code>ocaml</code> command. Instead of <code>ocaml script</code>,
one should now write <code>ocaml ./script</code> (#<a href="https://github.com/ocaml/ocaml/pull/11253">11253</a>). The compiler&rsquo;s
bootstrap process (this is the mechanism which updates the initial compiler in <code>boot/ocamlc</code> which is used to build
the compiler &ldquo;from cold&rdquo;) is now reproducible (#<a href="https://github.com/ocaml/ocaml/pull/11149">11149</a>), easing the
review process for pull requests which need to include changes to the boot compiler. Previously we required a core
developer to re-do the bootstrap and then separately merge the work, where now a core developer can merely pull the
branch and check that the committed artefact is reproducible.
</p>

<p>
Looking beyond the release of OCaml 5.0, I&rsquo;ve also been working to resurrect the disabled Cygwin port of OCaml
(#<a href="https://github.com/ocaml/ocaml/pull/11642">11642</a>) and, more importantly, getting the MSVC native Windows port
working again (that&rsquo;s still WIP!).
</p>

<p>
At the OCaml Workshop this year, I demonstrated my &ldquo;relocatable compiler&rdquo; project, which aims both to eliminate
various kinds of &ldquo;papercut&rdquo; when using bytecode executables but, much more importantly, allows compiler
installations to be copied to new locations and still work, which paves the way for faster creation of opam switches
<span class="underline">everywhere</span>. It was great to be able to meet so many people in person in Slovenia for the first in-person workshop
since 2019, but unfortunately that came at the cost of catching COVID, which has slowed me down for the weeks since!
The next stage for the relocatable compiler is to have an opam remote which can be added to allow opt-in testing of
it with OCaml 4.08-5.0 and then to start opening pull requests hopefully for inclusion of the required changes in
OCaml 5.1 or 5.2.
</p>
</div>
</div>

<div id="outline-container-orga90e79b" class="outline-4">
<h4 id="orga90e79b">@sadiqj Sadiq Jaffer</h4>
<div class="outline-text-4" id="text-orga90e79b">
<p>
The bulk of my upstream work over the last year in OCaml 5.0 has been on Runtime Events, a new tracing and metrics
system that sits inside the OCaml runtime. The initial PR can be found at
#<a href="https://github.com/ocaml/ocaml/issues/10964">10964</a> and there was a separate documentation PR in
#<a href="https://github.com/ocaml/ocaml/issues/11349">11349</a>. Lucas Pluvinage has followed up with PR
#<a href="https://github.com/ocaml/ocaml/issues/11474">11474</a> which adds custom application events to Runtime Events and I
hope isn&rsquo;t too far off merging. We gave a talk at the OCaml Users and Developers workshop on Runtime Events and I&rsquo;m
hoping there will be a video up on that soon.
</p>
</div>
</div>

<div id="outline-container-org2d35417" class="outline-4">
<h4 id="org2d35417">@garrigue Jacques Garrigue</h4>
<div class="outline-text-4" id="text-org2d35417">
<p>
We have continued our work on refactoring the type checker for clarity and abstraction.
An interesting result was PR #<a href="https://github.com/ocaml/ocaml/issues/11027">11027</a>: separate typing of
counter-examples from <code>Typecore.type_pat</code>. Namely, around 2015 <code>type_pat</code> was converted to CPS style to allow a more
refined way to check the exhaustiveness of GADT pattern-matching. A few more changes made the code more and more
complex, but last year in #<a href="https://github.com/ocaml/ocaml/issues/10311">10311</a> we could extract a lot of code as
case-specific constraints. This in turn made possible separating <code>type_pat</code> into two functions: <code>type_pat</code> itself,
only used to type patterns in the source program, which doesn&rsquo;t need backtracking, and <code>check_counter_example_pat</code>,
a much simpler function which works on counter examples generated by the exhaustiveness checker.
I have also added a <code>-safer-matching</code> flag for people who don&rsquo;t want the correctness of compilation to depend on the
subtle typing arguments involved in this analysis (#<a href="https://github.com/ocaml/ocaml/issues/10834">10834</a>).
In another direction, we have reorganized the representation of type parameter variances, to make the lattice
involved more explicit (#<a href="https://github.com/ocaml/ocaml/issues/11018">11018</a>).
We have a few PRs waiting for merging: #<a href="https://github.com/ocaml/ocaml/issues/11536">11536</a> introduces some wrapper
functions for level management in types, #<a href="https://github.com/ocaml/ocaml/issues/11569">11569</a> removes the encoding
used to represent the path of hash-types associated with a class, as it was not used in any meaningful way.
</p>

<p>
There are also a large number of bug fixes (#<a href="https://github.com/ocaml/ocaml/issues/10738">10738</a>,
#<a href="https://github.com/ocaml/ocaml/issues/10823">10823</a>, #<a href="https://github.com/ocaml/ocaml/issues/10959">10959</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11109">11109</a>, #<a href="https://github.com/ocaml/ocaml/issues/11340">11340</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11648">11648</a>). The most interesting of them is
#<a href="https://github.com/ocaml/ocaml/issues/11648">11648</a>, which extends <code>type_desc</code> to allow keeping expansions inside
types. This is needed to fix a number of bugs, including #<a href="https://github.com/ocaml/ocaml/issues/9314">9314</a>, but
the change is invasive, and reviewing may take a while.
</p>

<p>
Coqgen, the Coq backend (previously named ocaml_in_coq), is still progressing, with the addition of constructs such
as loops, lazy values and exceptions <a href="https://github.com/COCTI/ocaml/pull/3">Coqgen</a>, and we are trying to include
GADTs in a comprehensive way.
</p>
</div>
</div>
