2022.11.15.html

<div id="outline-container-orga7eb81d" class="outline-4">
<h4 id="orga7eb81d">@gasche Gabriel Scherer</h4>
<div class="outline-text-4" id="text-orga7eb81d">
<p>
@nojb Nicolás Ojeda Bär has done very nice work on using tail-modulo-cons for some List functions of the standard
library, which I helped review along with Xavier Leroy:
</p>
<ul class="org-ul">
<li>#<a href="https://github.com/ocaml/ocaml/issues/11362">11362</a>: List.map, List.mapi, List.map2</li>
<li>#<a href="https://github.com/ocaml/ocaml/issues/11402">11402</a>: List.init, List.filter, List.filteri, List.filter_map</li>
</ul>

<p>
Some of those functions were hand-optimized to use non-tail-rec code on small inputs. Nicolás&rsquo; micro-benchmarks
showed that often the TMC-transformed version was a bit slower on very small lists, up to 20% slower on lists of
less than five elements. We wanted to preserve the performance of the existing code exactly, so we did some manual
unrollling in places. (The code is a bit less readable than the obvious versions, but much more readable than was
there before.)
</p>

<p>
I worked on fixing a 5.0 performance regression for bytecode-compiled programs (#<a href="https://github.com/ocaml/ocaml/issues/11337">11337</a> ). I started with the intuition that the overhead came from
having a concurrent skip list in the 5.x runtime instead of a non-concurrent skip list in the 4.x runtime, and wrote
tricky code to use a sequential skip list again. Soon I found out that the performance regression was due to
something completely different and had to dive into the minor-root-scanning code.
</p>

<p>
When I started looking at the multicore runtime, I had no idea how to print a backtrace from a C segfault without
using <code>valgrind</code>. I wrote some documentation on debugging in
<a href="https://github.com/ocaml/ocaml/blob/8796a4f4f0e4450795ee0bae2fb5bb32d313e5c7/runtime/HACKING.adoc">runtime/HACKING.adoc</a>
in the hope of helping other people.
</p>

<p>
I spent some time reading <code>lambda/switch.ml</code>, which compiles shallow-match-on-constructor-tags into conditionals and
jump tables. The file contains some references to research papers from the 90s, but it was unclear to me how they
connected to the implementation. After a nice discussion with Luc Maranget I could propose a documentation PR
#<a href="https://github.com/ocaml/ocaml/issues/11446">11446</a> to explain this in the source code itself. Thanks to Vincent
Laviron for the nice review &#x2013; as always.
</p>
</div>
</div>

<div id="outline-container-orgd22c05e" class="outline-4">
<h4 id="orgd22c05e">@gadmm Guillaume Munch-Maccagnoni</h4>
<div class="outline-text-4" id="text-orgd22c05e">
<p>
(written by @gasche)
</p>

<p>
Guillaume worked on updating the &ldquo;GC timing hooks&rdquo; and <code>caml_scan_roots_hook</code> of the OCaml runtime to be
multicore-safe, and added a new hook <code>caml_domain_terminated_hook</code>.
(#<a href="https://github.com/ocaml/ocaml/issues/10965">10965</a>, #<a href="https://github.com/ocaml/ocaml/issues/11209">11209</a>) We
rely on runtime hooks in our experimental <a href="https://gitlab.com/ocaml-rust/ocaml-boxroot/">boxroot</a> library, and
updating hooks for 5.0 was necessary to have a correct 5.0 version of boxroots.
</p>

<p>
Also related to our boxroot experiments, Guillaume wanted an efficient way to check whether a domain thread was
currently holding its runtime lock &#x2013; it does not when executing long non-OCaml computations that do not access the
OCaml runtime. Guillaume changed the <code>Caml_state</code> macro to provoke an error when accessing the domain state without
holding the domain runtime lock &#x2013; a programming mistake that could easily go unnoticed before in simple testing and
crash in hard-to-debug ways on different inputs &#x2013; and introduced a new <code>Caml_state_opt</code> macro that is NULL when the
runtime lock is not held. (#<a href="https://github.com/ocaml/ocaml/issues/11138">11138</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11272">11272</a>, #<a href="https://github.com/ocaml/ocaml/issues/11506">11506</a>).
</p>

<p>
Guillaume worked on quality treatment of asynchronous actions in the new Multicore runtime.
(#<a href="https://github.com/ocaml/ocaml/issues/10915">10915</a>, #<a href="https://github.com/ocaml/ocaml/issues/11039">11039</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11057">11057</a>, #<a href="https://github.com/ocaml/ocaml/issues/11095">11095</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11190">11190</a>). Asynchronous actions are callbacks called by an OCaml
program by the environment (instead of an explicit request by the programmer at the point they happen). They include
for example signal handlers, finalizers called by the GC, Statmemprof callbacks. Supporting them well requires
tricky code, because the runtime must ensure that such actions are executed promptly, but in a context where running
OCaml code is safe. (For example it is easy to have bugs where a asynchronous action raises an exception in the
middle of a runtime function that is not exception-safe.) The 4.x runtime had a lot of asynchronous-action fixes
between 4.10 and 4.14, but sadly many of these improvements were not backported in the Multicore branch (they
required expert adaptation to a very different runtime codebase), and were thus lost in the Multicore merge. The
present work tries to come back to a good state for 5.0 and 5.1 &#x2013; some of the fixes were unfortunately not merged
in time for 5.0. Statmemprof support is currently disabled for 5.x, and this work will also be useful for
Statmemprof.
</p>
</div>
</div>
</div>


<div id="outline-container-orgb277c7e" class="outline-3">
<h3 id="orgb277c7e">Guillaume Munch-Maccagnoni added</h3>
<div class="outline-text-3" id="text-orgb277c7e">
<p>
Thanks for the summary @gasche. (@gasche asked me to write about what I did; it took me too long to do it, so he
wrote something for me.) In addition to what @gasche described, many things I have worked on are not visible in the
change log, notably bug fixing and cleanups for the new multicore runtime.
</p>
</div>

<div id="outline-container-org0acd712" class="outline-4">
<h4 id="org0acd712">Systhreads</h4>
<div class="outline-text-4" id="text-org0acd712">
<p>
The runtime lock check feature was long-time requested by some foreign-function interface (FFI) users, also its
implementation sent me into a rabbit hole of fixes with the new systhread implementation
(#<a href="https://github.com/ocaml/ocaml/issues/11271">11271</a>, #<a href="https://github.com/ocaml/ocaml/issues/11385">11385</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11386">11386</a>, #<a href="https://github.com/ocaml/ocaml/issues/11390">11390</a>,
#<a href="https://github.com/ocaml/ocaml/issues/11473">11473</a>, #<a href="https://github.com/ocaml/ocaml/issues/11403">11403</a>), with
some fixes still pending. The multicore systhread implementation was new code with few experts, so this made it
benefit from needed attention.
</p>
</div>
</div>
