2022.11.15.org
*** Memory model

In a discussion in a conference call with OCaml developers shortly after the merge (to which I was invited thanks to
@kayceesrk), I was asking whether the accesses to the OCaml heap from C (runtime, VM and FFI) should not be made
atomic. At the time, the C parts of the runtime were accessing the OCaml heap through non-atomic loads and stores.
(More generally, adapting the OCaml runtime and existing FFI code to multicore requires explaining first how to
implement the OCaml memory model in the C memory model.) I do not remember the exact wording (and I would not be
able to quote it given that the meeting was unfortunately non-public), but I remember that the answer did not
convince me.

I later came back with concrete examples of undefined behaviour involving the ~Field~ macro
(#[[https://github.com/ocaml/ocaml/issues/10992][10992]]). This put it back on the radar and enabled OCaml developers
to start addressing this issue. Unfortunately, it appears that the question of the OCaml memory model for C code
will still not be clarified as of 5.0.

The challenge is finding a good balance between backwards-compatibility, efficiency and standards-compliance. A
first part was addressed by marking accesses via the ~Field~ macro ~volatile~
(#[[https://github.com/ocaml/ocaml/pull/11255][11255]]). The C ~volatile~ keyword does not imply atomicity according
to the standard, but it is used in many legacy codebases in this way, so this is likely to work while remaining
(mostly) backwards-compatible. (To my knowledge only ~Field~ which I gave as an example has been fixed. I suggested
that all runtime, VM and FFI API should be reviewed in the new light, but I am not aware that developers had the
time to do this yet. Similarly, user C code that is not using strictly the documented FFI and instead relies on
knowledge of the OCaml value representation in order to access values, will have to be audited before any use inside
multicore programs.)

Another issue still to be addressed is synchronizing the read of initial writes to values, as needed for memory
safety (this problem does not appear in the PLDI2018 paper, because it does not accurately model initial writes).
Even leaving backwards-compatibility for the FFI aside, using ~memory_order_acquire~ on mutable loads would be cheap
on x86-64 but expensive on Arm. Instead, OCaml relies on some other order-preserving property that comes for free on
Arm (address dependency). Now, C compilers do not understand this notion yet ([[https://arxiv.org/abs/1701.00854v5][McKenney
2017]]), let alone let OCaml offer a backwards-compatible and standards-compliant
solution.

- [[https://github.com/ocaml/ocaml/issues/10992#issuecomment-1112394309][One solution]] which @kayceesrk and I proposed involves requiring users to change reads of mutable fields to using a different dedicated function or macro (doing an acquire atomic load), with some provisions that they can adapt their program to multicore gradually (e.g. legacy code still works due to absence of races/parallelism). (This is a milder situation in terms of backwards-compatibility than the one with the original concurrent multicore GC that led to its abandonment in favour of the stop-the-world design.)

- Another path I proposed was to rely on _de facto_ preservation of dependency ordering by current compilers (modulo a certain number of constraints and fingers-crossings), taking inspiration from the "Linux Kernel memory model" (which as it names does not indicate, denotes the absence of one); and to subsequently work towards specifying what this means in terms of OCaml's requirements. This would be the ideal approach, because it does not require legacy programs to be fixed. I had the chance to discuss this approach with @stedolan in Ljubljana in September, and without entering into technical details, one conclusion was that it was possibly interesting work, but very hypothetical. Moreover, other users of dependency ordering (e.g. Linux RCU) have different requirements, and are currently pushing propositions to evolve C/C++ that are going in directions that are not necessarily suited to OCaml's needs on this issue.

The risk is that OCaml programs end up in a no-man's-land in terms of C standards due to the ~volatile~ fix working
well enough (so far; as far as we know; etc.), and this even in the event where a purely standards-compliant
solution was later adopted by OCaml (but where users would lack motivation to adapt their code).

This issue has not received as much discussion as I had hoped; there was no feedback on the solutions.
Unfortunately, this problem not being addressed for 5.0 means that OCaml developers might be envisioning breaking
FFI changes later on, including changes that could cause API breakages in the multicore OCaml-Rust interface which I
have been working on.

*** Lazy in multicore

I came up with a design for thread-safe Lazys in multicore that would allow various efficient (and custom)
synchronization schemes
([[https://github.com/ocaml-multicore/ocaml-multicore/issues/750#issuecomment-978125441][ocaml-multicore#750]]) and I
started to implement a prototype. Lazy is currently thread-unsafe in multicore (although memory-safe); thread-safe
lazys would allow to implement optimally globals with delayed initialization, one common and convenient form of
synchronization in multithreaded languages (cf. "magic statics" in C++11, lazy statics in Rust), along with more
forms of lazy that are useful in theory but that have not been tried in practice yet.

Unfortunately there is a tedious [[https://github.com/ocaml/ocaml/issues/11182#issuecomment-1098275032][bootstrapping
issue]] with my prototype, and I have not made
progress since (help is welcome). Another lack of motivation comes from the fact that the lazy short-cutting has
been removed in OCaml 4.14 for fear it was too expensive for GC marking. If not for short-cutting, it would be
possible to implement lazy in a much simpler way directly in OCaml. So the runtime is currently in a weird state
where 95% of the invasive work to have the short-cutting optimization is still there, but the optimization is not
done (actually, only happens for lazys that are forced while still young). Luckily, a side-effect of my work
presented at the OCaml workshop is to show that lazy short-cutting comes essentially for free during GC marking
thanks to instruction-level parallelism on modern processors, so I expect the core OCaml developers to put it back
in.

*** Pooled mode

The work on Boxroot was also the occasion to see whether the obscure "pooled" mode whereby OCaml frees memory for
you (~OCAMLRUNPARAM=c~), was useful to us. I had a PR to fix bugs in this mode and to report other design issues,
but nobody was reviewing it after a year so I closed the PR. My reasoning is that since the mode is unmaintained and
its design is broken, we can as well advise FFI users to steer clear from this mode.

