2022.11.15.html

<div id="outline-container-org9728b98" class="outline-4">
<h4 id="org9728b98">Other projects</h4>
<div class="outline-text-4" id="text-org9728b98">
<p>
@gasche&rsquo;s original message mentioned my work on restoring some safety guarantees of asynchronous callbacks in OCaml
multicore. It is in fact a spin-off of past work where I aimed to show that it is possible to mix certain systems
programming requirements (correctly releasing resources and handling errors) with certain functional programming
requirements (being able to interrupt computation asynchronously), given the right language design. (My work on
memprof-limits was another part of this work.) AFAIU OCaml multicore was originally developed with the idea that it
is not really possible to handle asynchronous interruptions nicely at a language-design level, which explains that
they were given second-class status in the new runtime, despite many existing programs using them.
</p>

<p>
The work on Boxroot presented with @gasche at the ML workshop is meant to enable the development of safe interfaces
between OCaml and Rust. I am working on such an interface for multicore OCaml to serve as a common building block
for the few other projects in this area, by giving a reference implementation of the multicore memory-safety model.
We also opened an RFC opening the possibility to integrate Boxroot with the OCaml runtime, but there are a few
things to clarify before this can be considered.
</p>

<p>
At the OCaml workshop I presented an implementation in the runtime of a large page allocator with support for huge
pages (THP) and efficient pointer classification (i.e. what you need to point to dynamically-allocated memory in the
GC heap with sharing-like properties, à la Ancient and OCamlnet). It is part of longer-term goals, along with
Boxroot, aiming to show how it is possible to mix tracing GC with the idea of <span class="underline">linear allocation with re-use</span> coming
from linear logic (a.k.a. &ldquo;functional but in place&rdquo; in recent papers). (Such a hybrid allocation scheme could open
now possibilities in programming for large data or low latency requirements in functional programming.) This is
loosely inspired by old papers by Jean-Yves Girard on mixing linear, intuitionistic and classical reasoning inside
the same deductive system.
</p>

<p>
All this is part of a longer-term investigation into the mixing of systems and functional programming centred on the
notion of resource as a first-class value. (I have various ideas in this area ranging from hands-on to very
theoretical; students in France or in Cambridge UK should feel free to get in touch with me if they are interested
overall by this subject.)
</p>
</div>
</div>
</div>


<div id="outline-container-org429e4f6" class="outline-3">
<h3 id="org429e4f6">gasche replied</h3>
<div class="outline-text-3" id="text-org429e4f6">
<blockquote>
<p>
Luckily, a side-effect of my work presented at the OCaml workshop is to show that lazy short-cutting comes
essentially for free during GC marking thanks to instruction-level parallelism on modern processors, so I expect the
core OCaml developers to put it back in.
</p>
</blockquote>

<p>
My understanding of this issue is as follows:
</p>
<ul class="org-ul">
<li>None of the core developers is actively working on multicore lazy, so you would probably have to contribute yourself if you want to improve them. (I have on the occasion tried to help you along, and would be happy to do it again, but right now I would rather focus on boxroot.)</li>
<li>The reason why shortcutting was disabled is the interaction with GC prefetching which, as you explain, is currently missing from Multicore. Prefetching is important for performance in 4.x, and Jane Street would like to see it back in 5.x as well. Someone at Tarides is working on this (I don&rsquo;t know who, KC would). So it sounds likely that prefetching will make a comeback for 5.x, and one would have to adapt the implementation again to work with lazy shortcutting.</li>
</ul>

<p>
You posted your patch to the prefetching code to re-enable lazy shortcutting in
<a href="https://github.com/ocaml-multicore/ocaml-multicore/issues/750#issuecomment-986847502">https://github.com/ocaml-multicore/ocaml-multicore/issues/750#issuecomment-986847502</a>, with preliminary benchmarks
suggesting that it does not decrease the performance of marking. On the same issue, @lpw25 wondered whether we
really need shortcutting (what lazy-using programs actually depend on it for performance), suggesting that it is not
a high-priority issue.
</p>

<p>
One difficulty that I foresee is that there is no one strongly pushing for lazy shortcutting to come back (this
somewhat supports Leo&rsquo;s point), and at the same time it is hard to convince the Jane Street people that the
prefetching change you suggest is innocuous for their workflows (because only they can run the benchmarks they care
about, and apparently they are not motivated enough by this issue to run them with your patch).
</p>
</div>
</div>
