2022.11.15.html


<div id="outline-container-org8e56331" class="outline-3">
<h3 id="org8e56331">Richard Eisenberg said</h3>
<div class="outline-text-3" id="text-org8e56331">
<p>
The Jane Street compilers team is hard at work on a number of fronts, though perhaps less visibly than in the past.
Previously, we worked on a feature and got it merged upstream without releasing it internally. This meant that our
colleagues would have to wait for a main trunk release of OCaml before getting the new feature, a turnaround time
that was sometimes too slow. In order to decrease latency between feature conception and use, we have now changed to
a new workflow where we develop and release features internally while we work to upstream.
</p>

<p>
Not only does this new workflow get features into the hands of our developers faster, it also allows us to improve
the final product:
</p>

<ul class="org-ul">
<li>The upstreaming discussion can be informed by actual practice by the 700+ OCaml developers within Jane Street. We can, for example, examine developer adoption rates and performance impact with ease.</li>
<li>Because we can access the entire code base where a feature is deployed, we can correct design mistakes with low cost. For example, if a feature proves too confusing to use in practice, we can change its syntax. Indeed, Jane Street regularly makes broad updates to its code base, and this kind of change fits within our workflow. For main-trunk OCaml, this means that features are more fully tested than they could be otherwise.</li>
</ul>

<p>
Upstreaming &#x2013; contributing back to an open-source project and working in a language that reaches beyond our walls
&#x2013; remains a core value for the compilers team. (Indeed, one of my explicit job responsibilities at Jane Street is
to help facilitate this process.) In addition, all our compiler work is fully
<a href="https://github.com/ocaml-flambda/ocaml-jst">open-source</a>.
</p>

<p>
That said, we have a number of features we&rsquo;re excited to share progress on, listed below. Expect to see proper
proposals for these (posted to the <a href="https://github.com/ocaml/RFCs">RFCs repo</a>) in due course.
</p>

<p>
<b><a href="https://github.com/ocaml-flambda/ocaml-jst/tree/main/jane/doc">Local allocations</a></b>, implemented by Stephen Dolan
and Leo White. This adds support for stack-allocated blocks, enforcing memory safety by requiring that
heap-allocated blocks never point to stack-allocated blocks (and stack-allocated blocks never point to shorter-lived
stack-allocated blocks). Function arguments can be annotated as <code>local_</code> to say that the function does not store
that argument. For example,
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">map</span> : 'a list -&gt; <span style="color: #00824f;">f</span>:local_ ('a -&gt; 'b) -&gt; 'b list
</pre>
</div>

<p>
says that <code>map</code> does not store the function it is passed anywhere in the output, allowing the function closure to be
stack-allocated. Stack-allocated record, variants, etc., are also possible. See also <a href="https://www.youtube.com/watch?v=yGRn5ZIbEW8">Stephen Dolan&rsquo;s talk at
ML&rsquo;22</a>.
</p>

<p>
This is a large addition to OCaml&rsquo;s type system, and we&rsquo;re still learning about how to use it best. We are actively
learning from its deployment within Jane Street to influence the final version of this feature for upstreaming.
</p>

<p>
<b><code>include functor</code></b>, <a href="https://github.com/ocaml-flambda/ocaml-jst/pull/32">implemented</a> by Chris Casinghino. This
syntactic extension allows a module to include the results of applying a functor to the prefix of the module already
written. For example:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module type</span> <span style="color: #444fcf;">Indexed_collection</span> = <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #444fcf;">'a t</span>
  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">mapi</span> : 'a t -&gt; <span style="color: #00824f;">f</span>:(int -&gt; 'a -&gt; 'b) -&gt; 'b t
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #444fcf;">Make_map</span><span style="color: #007a9f;">(M : </span><span style="color: #444fcf;">Indexed_collection</span><span style="color: #007a9f;">) </span>: <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">map</span> : 'a <span style="color: #444fcf;">M.</span>t -&gt; <span style="color: #00824f;">f</span>:('a -&gt; 'b) -&gt; 'b <span style="color: #444fcf;">M.</span>t
<span style="color: #000000; font-weight: bold;">end</span> = <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a7601f;">map</span> <span style="color: #007a9f;">t</span> ~<span style="color: #007a9f;">f</span> = <span style="color: #444fcf;">M.</span>mapi t <span style="color: #00824f;">~f</span>:(<span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">_</span> -&gt; f)
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #444fcf;">List</span> = <span style="color: #000000; font-weight: bold;">struct</span>
  <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #444fcf;">'a t</span> =
  | <span style="color: #242521; background-color: #fcf7ef;">Nil</span>
  | <span style="color: #242521; background-color: #fcf7ef;">Cons</span> <span style="color: #006f00; font-weight: bold;">of</span> 'a * 'a t

  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a7601f;">mapi</span> <span style="color: #007a9f;">t</span> ~<span style="color: #007a9f;">f</span> = ...

  <span style="color: #000000; font-weight: bold;">include</span> <span style="color: #000000; font-weight: bold;">functor</span> <span style="color: #242521; background-color: #fcf7ef;">Make_map</span>
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #007a9f;">evens</span> = <span style="color: #444fcf;">List.</span>(map (<span style="color: #242521; background-color: #fcf7ef;">Cons</span> (<span style="color: #00824f;">1</span>, <span style="color: #242521; background-color: #fcf7ef;">Cons</span> (<span style="color: #00824f;">2</span>, <span style="color: #242521; background-color: #fcf7ef;">Cons</span> (<span style="color: #00824f;">3</span>, <span style="color: #242521; background-color: #fcf7ef;">Nil</span>)))) <span style="color: #00824f;">~f</span>:(<span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">x</span> -&gt; x*<span style="color: #00824f;">2</span>))
</pre>
</div>

<p>
Despite being &ldquo;just&rdquo; a syntactic convenience, this has already received wide uptake within Jane Street.
</p>

<p>
<b>Comprehensions</b>, <a href="https://github.com/ocaml-flambda/ocaml-jst/pull/46">implemented</a> by Antal Spector-Zabusky. This
adds support for both list and array comprehensions, such as
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a7601f;">pythagorean_triples_up_to</span> <span style="color: #007a9f;">n</span> =
  [ a,b,c
    <span style="color: #006f00; font-weight: bold;">for</span> a = <span style="color: #00824f;">1</span> <span style="color: #006f00; font-weight: bold;">to</span> n
    <span style="color: #006f00; font-weight: bold;">for</span> b = a <span style="color: #006f00; font-weight: bold;">to</span> n
    <span style="color: #006f00; font-weight: bold;">for</span> c = b <span style="color: #006f00; font-weight: bold;">to</span> n
    <span style="color: #006f00; font-weight: bold;">when</span> a * a + b * b = c * c ]
</pre>
</div>

<p>
The feature works similarly for arrays, with <code>[| ... |]</code> syntax.
</p>

<p>
<b>Immutable arrays</b>, <a href="https://github.com/ocaml-flambda/ocaml-jst/pull/47">implemented</a> by Antal Spector-Zabusky.
This adds support for immutable arrays. These are just like normal arrays, but immutability ensures that the
contents of the array do not change.
</p>

<p>
<b>Unboxed types</b>, with a very early <a href="https://github.com/ocaml-flambda/ocaml-jst/pull/48">implementation</a> by Chris
Casinghino and <a href="https://github.com/ocaml/RFCs/pull/34">proposal</a> by me (with the help of my colleagues). <a href="https://www.youtube.com/watch?v=RV-4Xddk0Yc">Stephen
Dolan</a> <a href="https://www.youtube.com/watch?v=Vevld4cXSYk">and I</a> have given
talks about the design.
</p>

<p>
Currently, all variables and fields must store values that are stored in a single machine word (e.g. 64 bits);
furthermore, this word must either be a pointer to garbage-collected memory or have its bottom bit tagged to denote
that the garbage collector should skip it. Unboxed types relax this restriction, allowing a single variable or field
to hold structures smaller or larger than a word, or store a word that the garbage collector will know not to scan.
In so doing, unboxed types effectively allow records and variants to be inlined into one another, enabling
programmers to structure their compile-time abstractions differently than their run-time memory layout.
</p>

<p>
The core innovation is the notion of a <i>layout</i>, which classifies a type (much like a type classifies a value). A
layout describes how a value should be stored and whether it can be examined by the garbage collector. By assigning
layouts to abstract types and type variables, we can abstract over non-word layouts. Much more is in the
<a href="https://github.com/ocaml/RFCs/pull/34">proposal</a>.
</p>

<p>
<b>Polymorphic parameters</b>, <a href="https://github.com/ocaml-flambda/ocaml-jst/pull/14">implemented</a> and
<a href="https://github.com/lpw25/ocaml-jst/blob/poly-param2/jane/doc/polymorphic-parameters.md">documented</a> by Leo White.
This feature allows function parameters to have polymorphic types. For example:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a7601f;">select</span>
  : 'b 'c. <span style="color: #007a9f;">selector</span>:<span style="color: #444fcf;">('a. ('a * 'a) -&gt; 'a) -&gt; ('b * 'b) list -&gt; ('c * 'c) list -&gt; ('b * 'c) list</span>
<span style="color: #444fcf;">  </span>= <span style="color: #006f00; font-weight: bold;">fun</span> ~<span style="color: #007a9f;">selector</span> <span style="color: #007a9f;">bbs</span> <span style="color: #007a9f;">ccs</span> -&gt;
    <span style="color: #444fcf;">List.</span>map2 (<span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">bb</span> <span style="color: #007a9f;">cc</span> -&gt; selector bb, selector cc) bbs ccs
</pre>
</div>

<p>
The <code>select</code> function chooses either the first components or the second components of the input lists to comprise
the output list. The <code>selector</code> function must be polymorphic, because the elements in the pairs in the input lists
may have different types. (Note that <code>'b</code> and <code>'c</code> are universally quantified in the type of <code>select</code>, so we know
that the type checker does not unify them.)
</p>
</div>
</div>
</div>
