2022.11.15.org
* diskuvbox: small set of cross-platform CLI tools
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-diskuvbox-small-set-of-cross-platform-cli-tools/9663/8

** jbeckford announced


Version 0.1.1 is now available from opam. Upgrade with:

#+begin_src shell
opam update
opam upgrade diskuvbox
#+end_src

Changes include:
- A bugfix for 32-bit OCaml systems; copying of large files now works.
- This is the first version to officially include standalone binaries. They are available at https://github.com/diskuv/diskuvbox/releases/tag/0.1.1 for Linux/Intel 32- and 64-bit, macOS/Intel, macOS/Silicon, Windows/Intel 32- and 64-bit
      



* http_async 0.2.0
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-http-async-0-2-0/10784/1

** Anurag Soni announced


I'd like to announce the initial release of [[https://github.com/anuragsoni/http_async][http_async]].

*Http_async*: provides a HTTP/1.1 web server for [[https://opensource.janestreet.com/async/][async]].

The library started life as a wrapper around httpaf, but has evolved over time to be a standalone implementation of
an HTTP/1.1 server. It implements its own parser that works on big strings and is reasonably fast. The library
supports the common use-cases of connection pipelining, streaming request and response bodies. Servers can be run on
both IP and Unix domain sockets, and ships with optional ~Core.Command~ entry points.

The implementation initially started as a testing ground for my I/o library
[[https://github.com/anuragsoni/shuttle][shuttle]], but I've been happy enough with the resulting api that I intend to
support this as a standalone library moving forward. As far as performance is concerned, I always recommend doing
your own tests with workloads that are closer to the intended use, but in my tests the performance seems very
reasonable. There is a version of http_async that's part of the http benchmarks run for the multicore project and
the results looked fairly decent when compared to other single threaded runtimes (see
https://github.com/ocaml-multicore/retro-httpaf-bench/pull/24 for more details)

*** Hello World server

#+begin_src ocaml
open! Core
open Async
open Http_async

let () =
  Command_unix.run
    (Server.run_command ~summary:"Hello world HTTP Server" (fun peer_addr _request ->
       return (Response.create `Ok, Body.Writer.string "Hello World")))
;;
#+end_src

The library doesn't ship with any routers, or a middleware composition API with the intention that those will be
layers that will live as a separate library. It should be easy to plug this into a third party routing library like
~ocaml-dispatch~ or ~routes~. Some examples can be seen at:
https://github.com/anuragsoni/http_async/tree/main/example and
https://github.com/anuragsoni/http_async/blob/main/bench/server_bench.ml and documentation is available
[[https://anuragsoni.github.io/http_async/http_async/Http_async/index.html][online]].

*** Install

**** To use the version published on opam:

#+begin_example
opam install http_async
#+end_example

**** For the development version:

#+begin_example
opam pin add http_async.dev git+https://github.com/anuragsoni/http_async.git
#+end_example

If you try the library and experience any issues, or have further questions, please report an issue on the Github
Issue tracker.
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 6
:END:
** From the ocaml.org blog


Here are links from many OCaml blogs aggregated at [[https://ocaml.org/blog/][the ocaml.org blog]].

- [[https://tech.ahrefs.com/how-to-get-started-with-ocaml-in-2022-2f22b578b984][How to get started with OCaml in 2022]]
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
