2022.11.15.html




<div id="outline-container-4" class="outline-2">
<h2 id="4">diskuvbox: small set of cross-platform CLI tools</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-diskuvbox-small-set-of-cross-platform-cli-tools/9663/8">https://discuss.ocaml.org/t/ann-diskuvbox-small-set-of-cross-platform-cli-tools/9663/8</a>
</p>
</div>

<div id="outline-container-org1edb388" class="outline-3">
<h3 id="org1edb388">jbeckford announced</h3>
<div class="outline-text-3" id="text-org1edb388">
<p>
Version 0.1.1 is now available from opam. Upgrade with:
</p>

<div class="org-src-container">
<pre class="src src-shell">opam update
opam upgrade diskuvbox
</pre>
</div>

<p>
Changes include:
</p>
<ul class="org-ul">
<li>A bugfix for 32-bit OCaml systems; copying of large files now works.</li>
<li>This is the first version to officially include standalone binaries. They are available at <a href="https://github.com/diskuv/diskuvbox/releases/tag/0.1.1">https://github.com/diskuv/diskuvbox/releases/tag/0.1.1</a> for Linux/Intel 32- and 64-bit, macOS/Intel, macOS/Silicon, Windows/Intel 32- and 64-bit</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">http_async 0.2.0</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-http-async-0-2-0/10784/1">https://discuss.ocaml.org/t/ann-http-async-0-2-0/10784/1</a>
</p>
</div>

<div id="outline-container-org290706f" class="outline-3">
<h3 id="org290706f">Anurag Soni announced</h3>
<div class="outline-text-3" id="text-org290706f">
<p>
I&rsquo;d like to announce the initial release of <a href="https://github.com/anuragsoni/http_async">http_async</a>.
</p>

<p>
<b>Http_async</b>: provides a HTTP/1.1 web server for <a href="https://opensource.janestreet.com/async/">async</a>.
</p>

<p>
The library started life as a wrapper around httpaf, but has evolved over time to be a standalone implementation of
an HTTP/1.1 server. It implements its own parser that works on big strings and is reasonably fast. The library
supports the common use-cases of connection pipelining, streaming request and response bodies. Servers can be run on
both IP and Unix domain sockets, and ships with optional <code>Core.Command</code> entry points.
</p>

<p>
The implementation initially started as a testing ground for my I/o library
<a href="https://github.com/anuragsoni/shuttle">shuttle</a>, but I&rsquo;ve been happy enough with the resulting api that I intend to
support this as a standalone library moving forward. As far as performance is concerned, I always recommend doing
your own tests with workloads that are closer to the intended use, but in my tests the performance seems very
reasonable. There is a version of http_async that&rsquo;s part of the http benchmarks run for the multicore project and
the results looked fairly decent when compared to other single threaded runtimes (see
<a href="https://github.com/ocaml-multicore/retro-httpaf-bench/pull/24">https://github.com/ocaml-multicore/retro-httpaf-bench/pull/24</a> for more details)
</p>
</div>

<div id="outline-container-org24d70bf" class="outline-4">
<h4 id="org24d70bf">Hello World server</h4>
<div class="outline-text-4" id="text-org24d70bf">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">open! </span><span style="color: #444fcf;">Core</span>
<span style="color: #000000; font-weight: bold;">open </span><span style="color: #444fcf;">Async</span>
<span style="color: #000000; font-weight: bold;">open </span><span style="color: #444fcf;">Http_async</span>

<span style="color: #000000; font-weight: bold;">let</span> () =
  <span style="color: #444fcf;">Command_unix.</span>run
    (<span style="color: #444fcf;">Server.</span>run_command <span style="color: #00824f;">~summary</span>:<span style="color: #ca3400;">"Hello world HTTP Server"</span> (<span style="color: #006f00; font-weight: bold;">fun</span> <span style="color: #007a9f;">peer_addr</span> <span style="color: #007a9f;">_request</span> -&gt;
       return (<span style="color: #444fcf;">Response.</span>create <span style="color: #242521; background-color: #fcf7ef;">`Ok</span>, <span style="color: #444fcf;">Body.Writer.</span>string <span style="color: #ca3400;">"Hello World"</span>)))
<span style="color: #ff4500;">;;</span>
</pre>
</div>

<p>
The library doesn&rsquo;t ship with any routers, or a middleware composition API with the intention that those will be
layers that will live as a separate library. It should be easy to plug this into a third party routing library like
<code>ocaml-dispatch</code> or <code>routes</code>. Some examples can be seen at:
<a href="https://github.com/anuragsoni/http_async/tree/main/example">https://github.com/anuragsoni/http_async/tree/main/example</a> and
<a href="https://github.com/anuragsoni/http_async/blob/main/bench/server_bench.ml">https://github.com/anuragsoni/http_async/blob/main/bench/server_bench.ml</a> and documentation is available
<a href="https://anuragsoni.github.io/http_async/http_async/Http_async/index.html">online</a>.
</p>
</div>
</div>

<div id="outline-container-org8f09c0b" class="outline-4">
<h4 id="org8f09c0b">Install</h4>
<div class="outline-text-4" id="text-org8f09c0b">
</div>
<ul class="org-ul">
<li><a id="org1944e51"></a>To use the version published on opam:<br />
<div class="outline-text-5" id="text-org1944e51">
<pre class="example" id="orgafca7ee">
opam install http_async
</pre>
</div>
</li>

<li><a id="orgf4a5e60"></a>For the development version:<br />
<div class="outline-text-5" id="text-orgf4a5e60">
<pre class="example" id="org9760204">
opam pin add http_async.dev git+https://github.com/anuragsoni/http_async.git
</pre>

<p>
If you try the library and experience any issues, or have further questions, please report an issue on the Github
Issue tracker.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Other OCaml News</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgae7a79e" class="outline-3">
<h3 id="orgae7a79e">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-orgae7a79e">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://tech.ahrefs.com/how-to-get-started-with-ocaml-in-2022-2f22b578b984">How to get started with OCaml in 2022</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgf7955cd" class="outline-2">
<h2 id="orgf7955cd">Old CWN</h2>
<div class="outline-text-2" id="text-orgf7955cd">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I&rsquo;ll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org7e1e65d">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>